In [1]:
import pandas as pd
df = pd.DataFrame({'Category':['Games','Games','Games', 'Film&Video','Film&Video','Film&Video'],
                  'Project_Title':['The Last Faith','Magic Puzzles','Dinosaur Fossil Hunter', 'Beyond Your Eyes','5150','8-Bit Wars'],
                  'Pledged':[92774,2873519,7962,276,23963,6950],
                  'Country':['UK','USA','Poland','Bulgaria','USA','UK'],
                  'Date_Start':['2020-03-21','2020-03-11','2020-04-16','2020-02-09','2020-04-10','2020-03-19']})
df

     Category           Project_Title  Pledged   Country  Date_Start
0       Games          The Last Faith    92774        UK  2020-03-21
1       Games           Magic Puzzles  2873519       USA  2020-03-11
2       Games  Dinosaur Fossil Hunter     7962    Poland  2020-04-16
3  Film&Video        Beyond Your Eyes      276  Bulgaria  2020-02-09
4  Film&Video                    5150    23963       USA  2020-04-10
5  Film&Video              8-Bit Wars     6950        UK  2020-03-19

In [5]:
df.groupby('Category').sum('Pledged')

            Pledged
Category
Film&Video    31189
Games       2974255

In [6]:
df.groupby('Category').mean('Pledged')

                  Pledged
Category
Film&Video   10396.333333
Games       991418.333333

In [7]:
df.groupby('Category').count()

            Project_Title  Pledged  Country  Date_Start
Category
Film&Video              3        3        3           3
Games                   3        3        3           3

In [16]:
df['Date_Start']=pd.to_datetime(df['Date_Start'])
df.groupby(pd.Grouper(key='Date_Start', freq='ME')).sum('Pledged')

            Pledged
Date_Start
2020-02-29      276
2020-03-31  2973243
2020-04-30    31925

In [17]:
df.groupby(pd.Grouper(key='Date_Start', freq='ME')).agg({'Pledged':'sum', 'Project_Title':'count'})

            Pledged  Project_Title
Date_Start
2020-02-29      276              1
2020-03-31  2973243              3
2020-04-30    31925              2

In [ ]:
df.groupby(['Country','Category']).sum('Pledged')

BRAKUJĄCE DANE

In [21]:
import numpy as np
df_with_nulls = pd.DataFrame({'A':[1,100,np.nan,1000,10000],
                             'B':[2,4,2,4,np.nan],
                             'C':[40,np.nan,20,np.nan,np.nan]})
df_with_nulls

         A    B     C
0      1.0  2.0  40.0
1    100.0  4.0   NaN
2      NaN  2.0  20.0
3   1000.0  4.0   NaN
4  10000.0  NaN   NaN

In [22]:
print(df_with_nulls.isnull().mean())

A    0.2
B    0.2
C    0.6
dtype: float64

In [23]:
print(df_with_nulls.isnull().sum())

A    1
B    1
C    3
dtype: int64

In [24]:
df_with_nulls[df_with_nulls['C'].isnull()]

         A    B   C
1    100.0  4.0 NaN
3   1000.0  4.0 NaN
4  10000.0  NaN NaN